Repository: vgromov/esfwx
Catalog: esfwx/tag-1.12/esshell-*/locale/esshell-*.*.po
Languages: ru_ru

source: %s Powered by: %s %s %s
ru_ru: %s Используется: %s %s %s

source: &Log off
ru_ru: Завершить сессию

source: About '%s'
ru_ru: О программе '%s'

source: About Shell...
ru_ru: Об оболочке...

source: Account '%s' is locked
ru_ru: Учетная запись '%s' заблокирована

source: Actions
ru_ru: Действия

source: Activities Log
ru_ru: Журнал событий

source: Another instance of '%s' is already running, aborting.
ru_ru: Другой экземпляр '%s' уже выполняется, отмена запуска.

source: Application help
ru_ru: Показать файл справки по приложению

source: Are you sure you want to log-off current user session?
ru_ru: Вы уверены, что хотите завершить текущую сессию пользователя?

source: Cannot create standard directory structure '%s'
ru_ru: Невозможно создать стандартные папки '%s'

source: Clear activities log
ru_ru: Очистить журнал событий

source: Clear log
ru_ru: Очистить журнал

source: Configure shell options
ru_ru: Настроить опции оболочки

source: Confirm log-off
ru_ru: Подтверждение завершения сессии

source: Copyright: %s
ru_ru: Авт. права: %s

source: Could not change security role of the system account '%s'
ru_ru: Невозможно изменить роль системной учетной записи '%s'

source: Crash report generated in '%s'
ru_ru: Отчет об ошибках создан в '%s'

source: Customize user interface
ru_ru: Настройка интерфейса пользователя

source: Data
ru_ru: Данные

source: Date:
ru_ru: Дата:

source: Description:
ru_ru: Описание:

source: Developers:
ru_ru: Разработчики:

source: Display information about Sell appplication
ru_ru: Показать информацию о приложении

source: E&xit
ru_ru: Выйти

source: Ekosfera Multipurpose Extendable Application Shell
ru_ru: Многоцелевая Расширяемая Программная Оболочка Экосфера

source: Ekosfera Shell
ru_ru: МРПО Экосфера

source: Ekosfera Shell [%s: %s]
ru_ru: МПРО Экосфера [%s: %s]

source: Enable logging to file
ru_ru: Включить запись журнала в файл

source: Error
ru_ru: Ошибка

source: Error accessing plugin interface for '%s'
ru_ru: Ошибка получения интерфейса для модуля '%s'

source: Error(s) occured
ru_ru: Возникли ошибки

source: Exit application
ru_ru: Выйти из приложения

source: Fatal exception occured
ru_ru: Возникла критическая ошибка

source: File
ru_ru: Файл

source: GUI elements font:
ru_ru: Шрифт элементов интерфейса:

source: Generic information
ru_ru: Общая информация

source: Help
ru_ru: Справка

source: Language
ru_ru: Язык

source: Level
ru_ru: Уровень

source: Loaded modules
ru_ru: Загруженные модули

source: Log On - '%s'
ru_ru: Войти - '%s'

source: Log off from current user session
ru_ru: Выйти из текущей сессии пользователя

source: Log to file
ru_ru: Запись в файл

source: Log-off cancelled
ru_ru: Выход из сессии отменен

source: Log-off cancelled. Operation aborted.
ru_ru: Выход из сессии отменен. Операция отменена.

source: Log-off is required to make requested changes. Click 'Yes' if want to log-off, 'No' to cancel changes.
ru_ru: Для вступления в силу запрашиваемых изменений необходимо завершить текущую сессию. Нажмите 'Да', если хотите завершить сессию, 'Нет' для отмены имзменений.

source: Log-off required
ru_ru: Требуется выход из сессии

source: Maximum value of time range is not valid
ru_ru: Значение максимума временного периода неверно

source: Menu font:
ru_ru: Шрифт элементов меню:

source: Miminum time value may not be greater than maximum
ru_ru: Значение минимума не может быть больше максимума

source: Minimum value of time range is not valid
ru_ru: Значение минимума временного периода неверно

source: N/A
ru_ru: Н/Д

source: New user name may not be the same as the old one
ru_ru: Новое имя пользователя не может быть таким же, как старое

source: Options
ru_ru: Настройки

source: Password length must not be shorter than %d symbols
ru_ru: Длина пароля не может быть короче, чем %d символов

source: Password:
ru_ru: Пароль:

source: Plugin module '%s' could not be loaded
ru_ru: Подключаемый модуль '%s' не может быть загружен

source: Plugin module entry point could not be found in '%s'
ru_ru: Корневая процедура модуля '%s' не найдена

source: Product version: %s
ru_ru: Версия продукта: %s

source: Product web site
ru_ru: Веб сайт продукта

source: Registered plugins
ru_ru: Зарегистрированные модули

source: Remember password
ru_ru: Запомнить пароль

source: Role:
ru_ru: Роль:

source: Security information was not initialized properly
ru_ru: Данные безопасности не были правильно инициализированы

source: Select user interface language
ru_ru: Выберите язык пользовательского интерфейса

source: Set Device Date and Time
ru_ru: Установите время и дату устройства

source: Shell Options...
ru_ru: Настройки оболочки...

source: Show|hide application log
ru_ru: Показать/спрятать журнал приложения

source: Show|hide plugin list pane
ru_ru: Показать/спрятать список подключаемых модулей

source: Show|hide quick access toolbar
ru_ru: Показать/спрятать панель быстрого доступа

source: Sync with PC Date and Time
ru_ru: Синхронизировать со временем и датой ПК

source: System administrator account may not be locked
ru_ru: Учетная запись системного администратора не может быть заблокирована

source: The following error(s) occurred while loading plugin modules: %s
ru_ru: Следующие ошибки возникли при загрузке поключаемых модулей: %s

source: Time value is out of range
ru_ru: Значение времени лежит вне допустимого диапазона

source: Time, (HH:MM:SS):
ru_ru: Время, (ЧЧ:ММ:СС):

source: Timestamp
ru_ru: Временная метка

source: Translators:
ru_ru: Локализаторы:

source: Unhandled exception caught, program will terminate.
ru_ru: Возникла необработанная исключительная ситуация, приложение будет остановлено.

source: Unidentified error occured while loading '%s' plugin module
ru_ru: Неизвестная ошибка при загрузке модуля '%s'

source: User '%s' is system user and may not be deleted
ru_ru: Пользователь '%s' является системным, и не может быть удален

source: User may not delete itself
ru_ru: Пользователь не может удалить сам себя

source: User name length must not be shorter than %d symbols
ru_ru: Имя пользователя не может быть короче, чем %d символов

source: User name must begin with alphanumeric symbol
ru_ru: Имя пользователя должно начинаться с буквенно-цифрового символа

source: User name must end with alphanumeric symbol
ru_ru: Имя пользователя должно оканчиваться на буквенно-цифровой символ

source: User:
ru_ru: Пользователь:

source: Users with role '%s' do not have rights to add security accounts
ru_ru: У пользователей с ролью '%s' недостаточно прав для добавления учетных записей

source: Users with role '%s' do not have rights to change security accounts
ru_ru: У пользователей с ролью '%s' недостаточно прав для изменения учетных записей

source: Users with role '%s' do not have rights to delete security accounts
ru_ru: У пользователей с ролью '%s' недостаточно прав для удаления учетных записей

source: Users with role '%s' may not change account role to '%s'
ru_ru: Пользователи с ролью '%s' не могут менять роль учетной записи на '%s'

source: Users with role '%s' may only add less secure accounts
ru_ru: Пользователи с ролью '%s' могут добавлять только учетные записи с меньшим уровнем доступа

source: Users with role '%s' may only change less secure accounts
ru_ru: Пользователи с ролью '%s' могут изменять только учетные записи с меньшим уровнем доступа

source: Users with role '%s' may only delete less secure accounts
ru_ru: Пользователи с ролью '%s' могут удалять только учетные записи с меньшим уровнем доступа

source: View
ru_ru: Вид

source: View Log
ru_ru: Показать журнал

source: View Plugin List
ru_ru: Показать список модулей

source: View Toolbar
ru_ru: Показать панель

source: Vsevolod V Gromov <vsevolod.gromov@mailfrom.ru>
ru_ru: Всеволод Громов <vsevolod.gromov@mailfrom.ru>

source: Warning
ru_ru: Предупреждение
