Repository: vgromov/esfwx
Catalog: esfwx/tag-1.12/escore/locale/escore.*.po
Languages: ru_ru

source: "%s" is not a valid floating point number
ru_ru: '%s' не является допустимым вещественным числом

source: Adding users with role '%s' is not allowed
ru_ru: Добавление пользователей с доступом '%s' запрещено

source: Administrator
ru_ru: Администратор

source: Cannot call method %s.%s of type %s without an object.
ru_ru: Невозможно выполнить метод %s.%s типа %s без экземпляра объекта.

source: Cannot create worker thread
ru_ru: Невозможно создать поток

source: Cannot find file|directory
ru_ru: Невозможно найти файл|директорию

source: Cannot find path
ru_ru: Невозможно найти путь

source: Cannot get property without an object.
ru_ru: Невозможно прочесть свойство без экземпляра объекта.

source: Cannot launch worker thread
ru_ru: Невозможно запустить поток

source: Cannot set property without an object.
ru_ru: Невозможно записать свойство без экземпляра объекта.

source: Child page index %d is out of [0, %d[ range.
ru_ru: Индекс %d дочерней страницы выпадает из диапазона [0, %d[.

source: Class "%s" is not registered.
ru_ru: Класс '%s' не зарегистрирован.

source: Class method %s, taking %d parameters, is not found in class %s
ru_ru: Метод класса %s, принимающий %d параметров, не найден в классе %s.

source: Contents:
ru_ru: Содержание:

source: Could not convert %d to a byte
ru_ru: Невозможно преобразовать %d в byte

source: Could not convert '%.0f' to integer
ru_ru: Невозможно преобразовать '%.0f' в integer

source: Could not convert '%.0f' to unsigned integer
ru_ru: Невозможно преобразовать '%.0f' в unsigned integer

source: Could not convert '%f.0' to integer
ru_ru: Невозможно преобразовать '%f.0' в integer

source: Could not convert '%s' to a byte
ru_ru: Невозможно преобразовать '%s' в byte

source: Could not convert '%s' to a single character
ru_ru: Невозможно преобразовать '%s' в char

source: Could not convert '%s' to signed integer
ru_ru: Невозможно преобразовать '%s' в signed integer

source: Could not convert 64 bit integer to string
ru_ru: Невозможно преобразовать 64 bit integer в строку

source: Could not convert binary buffer %d bytes long to a byte
ru_ru: Невозможно преобразовать буфер длиной %d байт в byte

source: Could not convert binary buffer %d bytes long to a single character
ru_ru: Невозможно преобразовать буфер длиной %d байт в single character

source: Data:
ru_ru: Данные:

source: Developer
ru_ru: Разработчик

source: Device %d is not a hub.
ru_ru: Устройство %d не пульт.

source: Device type %d is not an appliance.
ru_ru: Устройство %d не является измерительной головкой.

source: Disk Error
ru_ru: Дисковоя ошибка

source: Disk drive is not ready|no media in drive
ru_ru: Диск не готов|носитель отсутствует

source: Disk is write protected
ru_ru: Диск защищен от записи

source: Empty enum restriction definition is not allowed.
ru_ru: Пустое определение перечесляемого типа не допускается.

source: Empty string
ru_ru: Пустая строка

source: Error
ru_ru: Ошибка

source: Error composing DATETIME from: year: %d, month: %d, day: %d, hour: %d, minute: %d, second: %d, millisecond: %d
ru_ru: Ошибка инициализации DATETIME из компонентов: год: %d, месяц: %d, день: %d, час: %d, минута: %d, секунда: %d, миллисекунда: %d

source: File operation timed-out
ru_ru: Таймаут файловой операции

source: File system object is invalid
ru_ru: Неправильный объект файловой системы

source: File|path name is invalid
ru_ru: Неправильный путь|имя файла

source: Guest
ru_ru: Гость

source: Header:
ru_ru: Заголовок:

source: Help for plugin '%s'
ru_ru: Справка для модуля '%s'

source: Internal Error
ru_ru: Внутренняя ошибка

source: Invalid data file page offset specified: %d
ru_ru: Указано неверное смещение страницы данных: %d

source: Invalid enumeration %s item index %d.
ru_ru: Для перечисляемого типа %s указан неверный индекс члена %d.

source: Invalid method signature value: %d.
ru_ru: Неверное значение сигнатуры метода: %d

source: Invalid registered plugin index: %d.
ru_ru: Неверный индекс подкл. модуля: %d.

source: Main header page index %d out of [0, %d[ range.
ru_ru: Индекс главной страницы %d должен быть в диапазоне [0, %d[.

source: Make file system call failed
ru_ru: Вызов форматирования файловой системы не выполнен.

source: Method %s, taking %d parameters, is not found in class %s
ru_ru: Метод %s, принимающий %d параметров, не найден в классе %s

source: Method %s.%s of type %s does not expect parameters.
ru_ru: Метод %s.%s типа %s не принимает входных параметров.

source: No Error
ru_ru: Нет ошибок.

source: No file system is found
ru_ru: Файловая система не обнаружена.

source: No schema entry is registered for hub %d.
ru_ru: Функциональная схема не зарегистрирована для пульта %d.

source: None
ru_ru: Нет

source: Object already exists
ru_ru: Объект уже существует.

source: Page index %d out of [0, %d[ range.
ru_ru: Индекс страницы %d должен быть в диапазоне [0, %d[.

source: Parameter list expected in call to %s.%s of type %s.
ru_ru: Вызов метода %s.%s, типа %s, ожидает список входных параметров.

source: Password is not valid
ru_ru: Пароль не верен

source: Plugin '%s' activated
ru_ru: Модуль '%s' активирован

source: Plugin '%s' de-activated
ru_ru: Модуль '%s' деактивирован

source: Property %s.%s does not have default value.
ru_ru: Свойство %s.%s не имеет значения по-умолчанию.

source: Restriction value may not be NULL for non-empty restriction type
ru_ru: Значение ограничения не может быть пустым для не-пустого типа ограничения.

source: Restriction value may not be non-NULL for empty restriction type
ru_ru: Значение ограничения не может быть не-пустым для пустого типа ограничения

source: Select '%s' language
ru_ru: Выберите язык '%s'

source: Session %d:
ru_ru: Сессия %d:

source: Sizes of items are different, %d and %d
ru_ru: Размеры элементов отличаются, %d и %d

source: Superuser
ru_ru: Суперпользователь

source: The drive number is invalid
ru_ru: Неверный номер дискового устройства

source: The file or directory has read-only attribute, or the directory is not empty
ru_ru: Файл или папка доступны только для чтения, или папка не является пустой

source: The logical drive has no work area
ru_ru: Логический диск не содержит рабочей области

source: The method %s.%s of type %s is class method.
ru_ru: Метод %s.%s типа %s является методом класса.

source: The method %s.%s of type %s is not a class method and cannot be called without an object.
ru_ru: Метод %s.%s типа %s не является методом класса, и не может быть вызван без экземпляра объекта.

source: There is no "%s" property in class "%s".
ru_ru: Свойства "%s" у объекта "%s" нет.

source: Thread is already executing
ru_ru: Поток уже выполняется

source: Unique identifier
ru_ru: Уникальный идентификатор

source: Unknown XML sequence '%s'
ru_ru: Неизвестная последовательность XML '%s'

source: Unknown class method signature: %d.
ru_ru: Неизвестная сигнатура %d метода класса.

source: Unknown configuration property '%s'
ru_ru: Неизвестный конфигурационный параметр'%s'

source: Unknown device.
ru_ru: Неизвестное устройство.

source: Unknown device: %d.
ru_ru: Неизвестное устройство: %d.

source: Unknown exception occured in worker thread
ru_ru: Неизветсное исключение возникло в рабочем потоке

source: Unknown exception occured upon exiting worker thread
ru_ru: Неизвестная ошибка возникла при выходе из рабочего потока

source: Unknown file system result value: %d
ru_ru: Неизвестный результат файловой операции: %d

source: Unknown method signature: %d.
ru_ru: Неизвестная сигнатура метода: %d.

source: Unknown parser error.
ru_ru: Неизвестная ошибка парсера.

source: Unknown plugin ID: %d.
ru_ru: Неизвестный идентификатор подкл. модуля: %d.

source: Unknown signature %d
ru_ru: Неизвестная сигнатура %d.

source: Unknown string escape sequence with character '%c'
ru_ru: Неизвестная управляющая последовательность с символом '%c'

source: Unknown string escape sequence with character code 0x%X
ru_ru: Неизвестная управляющая последовательность с кодом 0x%X

source: User
ru_ru: Пользователь

source: User '%s' already exists
ru_ru: Пользователь '%s' уже существует

source: User '%s' does not exist
ru_ru: Пользователь '%s' не существует

source: User Interface Language Changed
ru_ru: Язык пользовательского интерфейса изменен

source: User Interface Language is changed. It will not take place until after application is restarted.
ru_ru: Язык пользовательского интерфейса изменен. Изменения вступят в силу только после перезагрузки приложения.

source: Users with role '%s' may only change themselves
ru_ru: Пользователи с ролью '%s' могут менять только свои данные

source: Validation error
ru_ru: Ошибка проверки

source: Validation failed for %s %s
ru_ru: Проверка не прошла для %s %s

source: Validator is not associated with control
ru_ru: Проверяющий объект не ассоциирован с элементом

source: Value %d is out of [%d, %d] range
ru_ru: Значение %d выпадает из диапазона [%d, %d]

source: Value %f is out of [%f, %f] range
ru_ru: Значение %f выпадает из диапазона [%f, %f]

source: Value %s is not a member of enumeration %s.
ru_ru: Значение %s не является членом перечисляемого типа %s.

source: Value '%s'=%d is out of [%d, %d] range
ru_ru: Значение '%s'=%d выпадает из диапазона [%d, %d]

source: Value '%s'=%f is out of [%f, %f] range
ru_ru: Значение '%s'=%f выпадает из диапазона [%f, %f]

source: Value must be greater than or equal to %f
ru_ru: Значение должно быть больше или равно %f

source: Value must be in range [%f, %f]
ru_ru: Значение должно лежать в диапазоне [%f, %f]

source: Value must be less than or equal to %f
ru_ru: Значение должно быть меньше или равно %f

source: Value name may not be the empty string.
ru_ru: Имя значения не может быть пустой строкой.

source: Value of %s must be greater than %s
ru_ru: Значение %s должно быть больше, чем %s

source: Value of %s must be greater than or equal to %s
ru_ru: Значение %s должно быть больше, или равно %s

source: Value of %s must be less than %s
ru_ru: Значение %s должно быть меньше, чем %s

source: Value of %s must be less than or equal to %s
ru_ru: Значение %s должно быть меньше, или равно %s

source: Value of %s must be one of: %s
ru_ru: Значение %s должно быть одним из: %s

source: Value of %s must fall in [%s,%s[ range
ru_ru: Значение %s должно лежать в диапазоне [%s, %s[

source: Value of %s must fall in [%s,%s] range
ru_ru: Значение %s должно лежать в диапазоне [%s, %s]

source: Value of %s must fall in ]%s,%s[ range
ru_ru: Значение %s должно лежать в диапазоне ]%s, %s[

source: Value of %s must fall in ]%s,%s] range
ru_ru: Значение %s должно лежать в диапазоне ]%s, %s]

source: Value with name '%s' already exists.
ru_ru: Значение с именем '%s' уже существует.

source: Value with name '%s' does not exist.
ru_ru: Значение с именем '%s' не существует.

source: Wide character with code 0x%X encountered in place where only eight-bit characters allowed
ru_ru: Многобайтовый символ с кодом 0x%X обнаружен там где допустимы только восьмибитовые символы.

source: Wrong configuration name. Expected '%s', got '%s'
ru_ru: Неверное имя конфигурации. Вместо '%s' выставлено '%s'

source: Wrong element count in range restriction definition. Expected 2, encountered %d.
ru_ru: Неверное число элементов в определении ограничения по диапазону. Ожидалось 2, найдено %d.

source: Wrong parameters count in call to %s.%s of type %s. Expected %d, got %d.
ru_ru: Неверное число параметров в вызове %s.%s типа %s. Ожидалось %d, получено %d.

source: Wrong range restriction. Min value may not be greater than Max one.
ru_ru: Неверное ограничение по диапазону. Минимум не может быть больше максимума.

source: Wrong restriction type. Array type is expected.
ru_ru: Неверный тип ограничения. Ожидается ограничение типа "массив".

source: XML document is malformed.
ru_ru: Документ XML неверно сформирован.

source: getAllLabels service is only valid for enumeration properties
ru_ru: getAllLabels метод доступен только для свойств перечисляемого типа.

source: getEnumItem service is only valid for enumeration properties
ru_ru: getEnumItems метод доступен только для свойств перечисляемого типа.

source: getValueLabel service is only valid for enumeration properties
ru_ru: getValueLabel метод доступен только для свойств перечисляемого типа.
